/*
 * @Author: your name
 * @Date: 2021-08-19 16:54:07
 * @LastEditTime: 2021-09-26 17:52:45
 * @LastEditors: Please set LastEditors
 * @Description: In User Settings Edit
 * @FilePath: \第三阶段 react + 小程序d:\companyCode\polaris-web-base\polaris-web-base\src\components\common\search-area\images\search.js
 */
import React from 'react';
import Icon from '@ant-design/icons';

const component = () => (
  <svg
    width="13px"
    height="13px"
    viewBox="0 0 13 13"
    version="1.1"
    xmlns="http://www.w3.org/2000/svg"
  >
    <g
      id="查询修改-0901"
      stroke="none"
      strokeWidth="1"
      fill="none"
      fillRule="evenodd"
    >
      <g
        id="11-交互说明"
        transform="translate(-732.000000, -361.000000)"
        fill="#999999"
        fillRule="nonzero"
      >
        <g id="编组-6" transform="translate(716.000000, 345.000000)">
          <g id="ic_search" transform="translate(16.000000, 16.000000)">
            <path
              d="M10.6466802,9.65972447 C12.4943059,7.31757064 12.3383058,3.90985174 10.17868,1.74807789 C9.0609919,0.62888203 7.54419455,0 5.9624999,0 C4.38080525,0 2.86400791,0.62888203 1.7463198,1.74807789 C-0.582106599,4.07943635 -0.582106599,7.85627341 1.7463198,10.1876319 C3.88629823,12.32961 7.292268,12.5264247 9.66471553,10.645198 L11.8129667,12.7963186 C11.9886266,12.9719833 12.2446564,13.0405882 12.4846123,12.9762904 C12.7245682,12.9119927 12.9119951,12.7245607 12.9762911,12.4845983 C13.0405871,12.2446359 12.9719841,11.9885991 12.7963242,11.8129344 L10.6466802,9.65972447 Z M2.678838,9.23628423 C0.867475538,7.42264253 0.867475538,4.48451287 2.678838,2.67087117 C3.54808103,1.80034258 4.72778522,1.31117849 5.95797312,1.31117849 C7.18816102,1.31117849 8.3678652,1.80034258 9.23710824,2.67087117 C11.0484707,4.48451287 11.0484707,7.42264253 9.23710824,9.23628423 C8.3678652,10.1068128 7.18816102,10.5959769 5.95797312,10.5959769 C4.72778522,10.5959769 3.54808103,10.1068128 2.678838,9.23628423 Z"
              id="形状"
            />
          </g>
        </g>
      </g>
    </g>
  </svg>
);

const searchSvg = (props) => <Icon component={component} {...props} />;

export default searchSvg;
